Revit 2027 API
PointCloudOverrides.SetPointCloudScanOverrideSettings(ElementId, PointCloudOverrideSettings) Method
 Assigns scan override settings to the whole PointCloudInstance element.
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetPointCloudScanOverrideSettings(
	ElementId elementId,
	PointCloudOverrideSettings newSettings
)
Public Sub SetPointCloudScanOverrideSettings (
	elementId As ElementId,
	newSettings As PointCloudOverrideSettings
)
public:
void SetPointCloudScanOverrideSettings(
	ElementId^ elementId,
	PointCloudOverrideSettings^ newSettings
)
member SetPointCloudScanOverrideSettings :
        elementId : ElementId *
        newSettings : PointCloudOverrideSettings -> unit
Parameters
elementId ElementId
 Id of the element to be overridden.
newSettings PointCloudOverrideSettings
 Override settings to be assigned.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PointCloudOverrides Class
SetPointCloudScanOverrideSettings Overload
Autodesk.Revit.DB.PointClouds Namespace